In [33]:
import pandas as pd
import numpy as np

In [34]:
data = pd.read_csv("editthisusingpandas - Sheet1.csv", header=None, names=['name'])

In [35]:
data.head()

                        name
0        Aakanksha (Bidhuna)
1  Aishwarya (jogavanipalem)
2      Akanksha (Bhubneswar)
3           Amrita (Chennai)
4             Anuja (Nashik)

In [36]:
data1 = data
data.name

0             Aakanksha (Bidhuna)
1       Aishwarya (jogavanipalem)
2           Akanksha (Bhubneswar)
3                Amrita (Chennai)
4                  Anuja (Nashik)
                  ...
1364            Vaishali Keshwani
1365           Vashundhara Sharma
1366                  Vidya Laxmi
1367                    Vinitha K
1368                         Zoha
Name: name, Length: 1369, dtype: object

In [37]:
data.name.str.split()

0             [Aakanksha, (Bidhuna)]
1       [Aishwarya, (jogavanipalem)]
2           [Akanksha, (Bhubneswar)]
3                [Amrita, (Chennai)]
4                  [Anuja, (Nashik)]
                    ...
1364            [Vaishali, Keshwani]
1365           [Vashundhara, Sharma]
1366                  [Vidya, Laxmi]
1367                    [Vinitha, K]
1368                          [Zoha]
Name: name, Length: 1369, dtype: object

In [38]:
data1 = data.name.str.split(pat='(', expand=True)
data1

                       0               1
0             Aakanksha         Bidhuna)
1             Aishwarya   jogavanipalem)
2              Akanksha      Bhubneswar)
3                Amrita         Chennai)
4                 Anuja          Nashik)
...                  ...             ...
1364   Vaishali Keshwani            None
1365  Vashundhara Sharma            None
1366         Vidya Laxmi            None
1367           Vinitha K            None
1368                Zoha            None

[1369 rows x 2 columns]

In [39]:
data2 = data1[0]
data2

0               Aakanksha
1               Aishwarya
2                Akanksha
3                  Amrita
4                   Anuja
               ...
1364     Vaishali Keshwani
1365    Vashundhara Sharma
1366           Vidya Laxmi
1367             Vinitha K
1368                  Zoha
Name: 0, Length: 1369, dtype: object

In [52]:
data3 = data2.str.split(n=1, expand=True)
data3

                0         1
0       Aakanksha      None
1       Aishwarya      None
2        Akanksha      None
3          Amrita      None
4           Anuja      None
...           ...       ...
1364     Vaishali  Keshwani
1365  Vashundhara    Sharma
1366        Vidya     Laxmi
1367      Vinitha         K
1368         Zoha      None

[1369 rows x 2 columns]

In [54]:
data3.columns = ['First name', 'Last name']
data3

       First name Last name
0       Aakanksha      None
1       Aishwarya      None
2        Akanksha      None
3          Amrita      None
4           Anuja      None
...           ...       ...
1364     Vaishali  Keshwani
1365  Vashundhara    Sharma
1366        Vidya     Laxmi
1367      Vinitha         K
1368         Zoha      None

[1369 rows x 2 columns]

In [55]:
data3.to_csv("namesSplit.csv")